
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЦеныНаНомера
	Движения.ЦеныНаНомера.Записывать = Истина;
	Для Каждого ТекСтрокаНомера Из Номера Цикл
		Движение = Движения.ЦеныНаНомера.Добавить();
		Движение.Период = Дата;
		Движение.ВидНомера = ТекСтрокаНомера.ВидНомера;
		Движение.Стоимость = ТекСтрокаНомера.Стоимость;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
