
&НаКлиенте
Процедура ПоселениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Поселение) И НЕ Объект.ОплатаПоЧастям Тогда 
		ОбновитьСумму(); 
	КонецЕсли;  
	Если НЕ ЗначениеЗаполнено(Объект.Поселение) И НЕ Объект.ОплатаПоЧастям Тогда 
		ОбнулитьСумму(); 
	КонецЕсли;  
КонецПроцедуры 

&НаСервере 
Процедура ОбновитьСумму()
	Объект.Сумма = Объект.Поселение.СуммаКУплате;		
КонецПроцедуры  

&НаСервере 
Процедура ОбнулитьСумму()
	Объект.Сумма = 0;	
КонецПроцедуры  

&НаКлиенте
Процедура ОплатаПоЧастямПриИзменении(Элемент)
	Если НЕ Объект.ОплатаПоЧастям Тогда  
		ОбновитьСумму();
	КонецЕсли;  
	ЭтаФорма.Элементы.Сумма.ТолькоПросмотр = НЕ Объект.ОплатаПоЧастям;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.Сумма.ТолькоПросмотр = НЕ Объект.ОплатаПоЧастям;
КонецПроцедуры
