
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Поселение") Тогда
		// Заполнение шапки
		Поселение = ДанныеЗаполнения.Ссылка;
		Сумма = ДанныеЗаполнения.СуммаКУплате; 
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОплатаЗаездовПостояльца Приход
	Движения.ОплатаЗаездов.Записывать = Истина;
	Движение = Движения.ОплатаЗаездов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Поселение = Поселение;
	Движение.Сумма = Сумма;  

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	УжеЗаплачено = СуммаОплатыЗаЗаезд();  
	ОсталосьЗаплатить = Поселение.СуммаКУплате - УжеЗаплачено;
	Если ОсталосьЗаплатить = 0 Тогда
		Сообщить("Это поселение полностью оплачено!");
		Отказ = Истина;
	Иначе 
		Если Сумма > ОсталосьЗаплатить Тогда
			Сообщить("Слишком большая сумма!");
			Сообщить("За поселение осталось заплатить: " + ОсталосьЗаплатить);
			Отказ = Истина; 
		Иначе
			ОсталосьЗаплатить = ОсталосьЗаплатить - Сумма;
			Сообщить("За поселение осталось заплатить: " + ОсталосьЗаплатить);
		КонецЕсли;		
	КонецЕсли;       
КонецПроцедуры  


Функция СуммаОплатыЗаЗаезд()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОплатаЗаездовОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОплатаЗаездов.Остатки КАК ОплатаЗаездовОстатки
		|ГДЕ
		|	ОплатаЗаездовОстатки.Поселение = &Поселение";
	
	Запрос.УстановитьПараметр("Поселение", Поселение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СуммаОстаток; 
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецФункции

