
Функция НомерСвободен(НомерГостиницы, НачалоПериода, КонецПериода) Экспорт
		
КонецФункции 


Функция НомерЗанят(НомерГостиницы, НачалоПериода, КонецПериода) Экспорт
		
КонецФункции 


Функция НомерЗабронирован(НомерГостиницы, НачалоПериода, КонецПериода) Экспорт
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бронирование.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Бронирование КАК Бронирование
		|ГДЕ
		|	(Бронирование.КонецПериода > &НачалоПериода
		|				И Бронирование.КонецПериода <= &КонецПериода
		|			ИЛИ Бронирование.НачалоПериода >= &НачалоПериода
		|				И Бронирование.НачалоПериода < &КонецПериода)";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.НомерГостиницы = НомерГостиницы Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЦикла; 
	Возврат Ложь;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА	
КонецФункции

