
&НаКлиенте
Функция ПоляРасчетаОплатыЗаполнены()
	Возврат 
		ЗначениеЗаполнено(Объект.НачалоПериода)
		И ЗначениеЗаполнено(Объект.КонецПериода)
		И ЗначениеЗаполнено(Объект.НомерГостиницы);
КонецФункции


&НаКлиенте
Процедура ПостоялецПриИзменении(Элемент)
	Если ПоляРасчетаОплатыЗаполнены()
	Тогда РасчетОплатыНаСервере();
	Иначе ОбнулитьПоляОплаты(); 
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	Если ПоляРасчетаОплатыЗаполнены()
	Тогда РасчетОплатыНаСервере();
	Иначе ОбнулитьПоляОплаты(); 
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	Если ПоляРасчетаОплатыЗаполнены()
	Тогда РасчетОплатыНаСервере();
	Иначе ОбнулитьПоляОплаты(); 
	КонецЕсли;  
КонецПроцедуры


&НаКлиенте
Процедура НомерГостиницыПриИзменении(Элемент)
	Если ПоляРасчетаОплатыЗаполнены()
	Тогда РасчетОплатыНаСервере();
	Иначе ОбнулитьПоляОплаты(); 
	КонецЕсли;                        
КонецПроцедуры     


&НаКлиенте
Процедура ПроцентУвеличенияПриИзменении(Элемент) 
	РасчетОплатыНаСервере();
КонецПроцедуры 


&НаСервере
Процедура ОбнулитьПоляОплаты()        
	Объект.СуммаОплаты = 0;
	Объект.СуммаСкидки = 0;     
	Объект.ПроцентСкидки = 0;
    Объект.СуммаКУплате = 0;
КонецПроцедуры


&НаСервере
Процедура РасчетОплатыНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РасчетЗначений();     
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры


         
